<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

class RenameDataToUkrainian extends Migration
{
    private const TRANSLATIONS_TYPES = [
        'Стекло лобовое' => 'Скло лобове',
        'Уплотнитель (молдинг/клипсы) лобового стекла или силикон под датчик' => 'Ущільнювач (молдинг/кліпси) лобового скла або силікон під датчик',
        'Стекло заднее обогреваемое' => 'Скло заднє з обігрівом',
        'Стекло заднее без обогрева' => 'Скло заднє без обігріву',
        'Уплотнитель (молдинг/клипсы) заднего стекла' => 'Ущільнювач (молдинг/кліпси) заднього скла',
        'Стекло левое боковое салона' => 'Скло ліве бокове салону',
        'Стекло правое боковое салона' => 'Скло праве бокове салону',
        'Стекло правое+левое' => 'Скло праве+ліве',
        'Стекло левое дверное переднее' => 'Скло ліве дверне переднє',
        'Стекло правое дверное переднее' => 'Скло праве дверне переднє',
        'Стекло дверное опускаемое левое+правое переднее' => 'Скло дверне, що опускається, ліве+праве переднє',
        'Стекло дверное глухое (форточка) левое+правое переднее' => 'Скло дверне стаціонарне (форточка) ліве+праве переднє',
        'Стекло левое дверное заднее' => 'Скло ліве дверне заднє',
        'Стекло правое дверное заднее' => 'Скло праве дверне заднє',
        'Стекло левое салона переднее (кузовное-глухое)' => 'Скло ліве салону переднє (кузовне-стаціонарне)',
        'Стекло правое салона переднее (кузовное-глухое)' => 'Скло праве салону переднє (кузовне-стаціонарне)',
        'Стекло левое салона переднее (кузовное) открываемое' => 'Скло ліве салону переднє (кузовне) яке відкривається',
        'Стекло правое салона переднее (кузовное) открываемое' => 'Скло праве салону переднє (кузовне) яке відкривається',
        'Стекло левое дверное переднее глухое (форточка)' => 'Скло ліве дверне переднє стаціонарне (форточка)',
        'Стекло правое дверное переднее глухое (форточка)' => 'Скло праве дверне переднє стаціонарне (форточка)',
        'Стекло левое заднее дверное глухое (форточка)' => 'Скло ліве заднє дверне стаціонарне (форточка)',
        'Стекло правое заднее дверное глухое (форточка)' => 'Скло праве заднє дверне стаціонарне (форточка)',
        'Стекло левое заднее в кузове глухое (форточка)' => 'Скло ліве заднє кузовне стаціонарне (форточка)',
        'Стекло правое заднее в кузове глухое (форточка)' => 'Скло праве заднє кузовне стаціонарне (форточка)',
        'Стекло левое заднее салона глухое (кузовное-глухое)' => 'Скло ліве заднє салону стаціонарне (кузовне-стаціонарне)',
        'Стекло правое заднее салона глухое (кузовное-глухое)' => 'Скло праве заднє салону стаціонарне (кузовне-стаціонарне)',
        'Стекло левое заднее салона (кузовное) открываемое' => 'Скло ліве заднє салону (кузовне) яке відкривається',
        'Стекло правое заднее салона (кузовное) открываемое' => 'Скло праве заднє салону (кузовне) яке відкривається',
    ];

    private const TRANSLATIONS_SHORTCUTS = [
        '1 отверстие' => '1 отвір',
        '2 отверстия' => '2 отвори',
        '3 отверстия' => '3 отвори',
        '4 отверстия' => '4 отвори',
        '5 отверстий' => '5 отворів',
        '6 отверстий' => '6 отворів',
        '7 отверстий' => '7 отворів',
        'антена' => 'антена',
        'без крепление для зеркала' => 'без кріплення для дзеркала',
        'без крепления для установки' => 'без кріплення для встановлення',
        'без обогрева' => 'без обігріву',
        'без окошка под номер кузова' => 'без віконця під номер кузова',
        'без отверстий' => 'без отворів',
        'без уплотнителя' => 'без ущільнювача',
        'верхний и нижний уплотнитель' => 'верхній та нижній ущільнювач',
        'верхний уплотнитель' => 'верхній ущільнювач',
        'выемка под дворник' => 'виїмка під склоочисник(двірник)',
        'датчик запотевания' => 'датчик запітніння',
        'датчик запотевания-крепление' => 'датчик запітніння-кріплення',
        'датчик запотевания-метка' => 'датчик запітніння-мітка',
        'датчик новый' => 'датчик новий',
        'датчик уже на стекле' => 'датчик вже на склі',
        'два датчика уже на стекле' => 'два датчика вже на склі',
        'два крепления для установки' => 'два кріплення для встановлення',
        'две антены' => 'дві антени',
        'защита от ультрафиолета+атермальное+"хамелеон"' => 'захист від ультрафіолету+атермальне+"хамелеон"',
        'крепление датчика' => 'кріплення датчика',
        'крепление двух датчиков' => 'кріплення для двох датчиків',
        'крепление для антены GPS' => 'кріплення для антени GPS',
        'крепление для зеркала' => 'кріплення для дзеркала',
        'крепление для зеркала другое' => 'інше кріплення для дзеркала',
        'крепление зеркала другое и в другом месте' => 'кріплення для дзеркала інше та в іншому місці',
        'крепление камеры' => 'кріплення для камери',
        'крепление комбинированное-датчика и камеры' => 'кріплення комбіноване-для датчику та камери',
        'крепление круглого датчика' => 'кріплення для круглого датчику',
        'крепление на две камеры' => 'кріплення на дві камери',
        'крепление на три камеры' => 'кріплення на три камери',
        'крыша металическая' => 'дах металевий ',
        'крыша стекляная' => 'дах скляний',
        'место под стоп сигнал и/или крепление' => 'місце під стоп сигнал та/або кріплення',
        'метка под датчик' => 'мітка під датчик',
        'метка под две камеры' => 'мітка під дві камери',
        'метка под камеру' => 'мітка під камеру',
        'метка под круглый датчик' => 'мітка під круглий датчик',
        'молдинг П-образный' => 'молдинг П-образний',
        'направляющая на стекле' => 'направляюча на склі',
        'нижний уплотнитель' => 'нижній ущільнювач',
        'обогрев стекла под дворниками' => 'обігрів скла під склоочисниками',
        'одно крепление для установки' => 'одне кріплення для встановлення',
        'окошко под номер кузова' => 'віконце під номер кузова',
        'открываемое' => 'скло яке відкривається',
        'полный обогрев стекла' => 'обігрів всього скла ',
        'полный обогрев стекла покрытием' => 'обігрів всього скла покриттям',
        'размер стекла другой' => 'інший розмір скла',
        'телевизионная антена' => 'антена телевізійна',
        'уплотнители по бокам' => 'ущільнювач по бокам',
        'уплотнитель/молдинг' => 'ущільнювач/молдинг',
        'хэд ап дисплей' => 'HUD-хед ап дісплей',
        'шелкография' => 'шовкографія',
        'шелкография изменённая' => 'змінена шовкографія',
    ];

    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        foreach (self::TRANSLATIONS_TYPES as $russian => $ukrainian) {
            DB::table('types')->where('translation', 'like', $russian)->update([
                'translation' => $ukrainian
            ]);
        }

        foreach (self::TRANSLATIONS_SHORTCUTS as $russian => $ukrainian) {
            DB::table('shortcuts')->where('meaning', 'like', $russian)->update([
                'meaning' => $ukrainian
            ]);
        }
    }
}
