<div class="col-lg-9">

    <div class="card my-4">
        <div class="card-header">
            Об интернет-магазине "Autoglass House"
        </div>
        <div class="card-body">
            <p>
                &emsp; Наш интернет-магазин "Autoglass House" осуществляет продажу и установку автомобильных
                стёкол таких мировых брендов как (Sekurit, Pilkington, AGC, Splintex, Autover,
                PGW и другие), а также Украинского производителя-SafeGlass.</p>
            <p>
                &emsp; Мы подберём Вам любое стекло на любой автомобиль. Если вам неудобно приехать к нам,
                мы доставим и установим(при соответствующих условиях) стекло по указаному адресу.
                Для Вашего удобства у нас есть выездной сервис.
            </p>
            <p>
                &emsp; Нашим клиентам с других регионов, доставим стекло перевозчиком "Новая почта", "Гюнсел" и др.
                Всегда готовы помочь Вам в вопросе подбора, доставки и установки нужного стекла!
            </p>
        </div>
    </div>

</div>
